Тест_ЗУП_31_КОРП/src/InformationRegisters/ИмпортированныеЭлементыПакетаSCORM/ИмпортированныеЭлементыПакетаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИмпортированныеЭлементыПакетаSCORM</name>
  <resources>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИмпортированныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлектронныеКурсы</types>
      <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ИмпортированныеЭлементыПакетаSCORM/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Функция проверяет был ли элемент пакета импортирован ранее.
// Если импорт был, то возвращает данный элемент.
//
Функция РанееИмпортированныйЭлемент(ИдентификаторПакета, ИмяЭлемента, ИдентификаторЭлемента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИдентификаторПакета не заполнен'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмяЭлемента не заполнен'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИдентификаторЭлемента не заполнен'");
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИмпортированныеЭлементы.ИмпортированныйЭлемент КАК ИмпортированныйЭлемент
	               |ИЗ
	               |	РегистрСведений.ИмпортированныеЭлементыПакетаSCORM КАК ИмпортированныеЭлементы
	               |ГДЕ
	               |	ИмпортированныеЭлементы.ИдентификаторПакета = &ИдентификаторПакета
	               |	И ИмпортированныеЭлементы.ИдентификаторЭлемента = &ИдентификаторЭлемента
	               |	И ИмпортированныеЭлементы.ИмяЭлемента = &ИмяЭлемента";
	
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	Запрос.УстановитьПараметр("ИмяЭлемента", ИмяЭлемента);
	Запрос.УстановитьПараметр("ИдентификаторЭлемента", ИдентификаторЭлемента);	
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	
	Возврат ВыборкаЗапроса.ИмпортированныйЭлемент;	
	
КонецФункции

Процедура ЗапомнитьИмпортЭлемента(ИмпортированныйЭлемент, ИдентификаторПакета, ИмяЭлемента, ИдентификаторЭлемента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмпортированныйЭлемент) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмпортированныйЭлемент не заполнен'");
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИдентификаторПакета не заполнен'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмяЭлемента не заполнен'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИдентификаторЭлемента не заполнен'");
	КонецЕсли;		
	
	МенеджерЗаписи = РегистрыСведений.ИмпортированныеЭлементыПакетаSCORM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмпортированныйЭлемент = ИмпортированныйЭлемент;
	МенеджерЗаписи.ИдентификаторПакета   = ИдентификаторПакета;
	МенеджерЗаписи.ИдентификаторЭлемента = ИдентификаторЭлемента;
	МенеджерЗаписи.ИмяЭлемента           = ИмяЭлемента;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
